err = {
    '-1'   : '用户名或好友码无效',
    '-2'   : '好友码无效',
    '-3'   : '未找到玩家',
    '-4'   : '用户过多',
    '-5'   : '曲名或曲目ID无效',
    '-6'   : '曲目ID无效',
    '-7'   : '没有找到曲目',
    '-8'   : '结果过多',
    '-9'   : '无效的难度',
    '-10'  : '无效的 recent/overflow 参数',
    '-11'  : 'Arc帐户分配失败',
    '-12'  : '删除好友失败',
    '-13'  : '添加好友失败',
    '-14'  : '该曲目没有Beyond难度',
    '-15'  : '未找到游玩记录',
    '-16'  : '该玩家已被封禁',
    '-17'  : '查询b30失败',
    '-18'  : '更新服务不可用',
    '-19'  : '无效搭档',
    '-20'  : '文件不可用',
    '-21'  : '无效范围',
    '-22'  : '定数的范围小于开始查询的结果',
    '-23'  : '潜力值低于阈值30（7.0）',
    '-24'  : '需要更新Arcaea，请联系维护人员',
    '-233' : '发生内部错误',
    '-500' : '该好友码已绑定'
}

class ArcError(Exception):

    def __init__(self, value: str):
        self.value = value
        self.error_str = err[value]